app/controllers/contexts_controller.rb

  def index
    @page_id = "contexts"
    @contexts = Context.all
---
SELECT * FROM "contexts" ORDER BY contexts.id DESC LIMIT 1

  def create
    @context = Context.new(params[:context])
    if @context.save
---
INSERT INTO "contexts" ("context_id", "updated_at", "service_class_id", "created_at") VALUES(NULL, '2010-12-03 08:15:40', NULL, '2010-12-03 08:15:40')

  def edit
    @page_id = "contexts"
    @context = Context.find(params[:id])
---
SELECT * FROM "contexts" WHERE ("contexts"."id" = 20)

  def update
    @context = Context.find(params[:id])
---
SELECT * FROM "contexts" WHERE ("contexts"."id" = 20)

  def destroy
    @context = Context.find(params[:id])
    @context.destroy
---
SELECT * FROM "contexts" WHERE ("contexts"."id" = 14)
DELETE FROM "contexts" WHERE ("id" IN (3,4,5,6,7,8))

  def parse_csv
    Context.delete_all
    params[:csv].each_line do |line|
      context = line.strip
      Context.create(:class_connections_form => context) unless context==""
---
DELETE FROM "contexts" WHERE 1=1
INSERT INTO "class_connections" ("context_id", "updated_at", "child_id", "parent_id", "created_at") VALUES(27, '2010-12-09 13:14:51', 16, 20, '2010-12-09 13:14:51')
INSERT INTO "contexts" ("context_id", "updated_at", "service_class_id", "created_at") VALUES(NULL, '2010-12-09 13:14:50', NULL, '2010-12-09 13:14:50')