app/controllers/service_classes_controller.rb

SELECT * FROM "service_classes"
---
  def index
    @page_id = "classes"
    @service_classes = ServiceClass.all

INSERT INTO "service_classes" ("name", "updated_at", "created_at") VALUES('A', '2010-12-02 23:49:56', '2010-12-02 23:49:56')
---
  def create
    @service_class = ServiceClass.new(params[:service_class])
    if @service_class.save

SELECT * FROM "service_classes" WHERE ("service_classes"."id" = 9)
---
  def edit
    @page_id = "classes"
    @service_class = ServiceClass.find(params[:id])

SELECT * FROM "service_classes" WHERE ("service_classes"."id" = 10)
UPDATE "service_classes" SET "name" = 'C', "updated_at" = '2010-12-03 00:00:41' WHERE "id" = 10
---
  def update
    @service_class = ServiceClass.find(params[:id])

      if @service_class.update_attributes(params[:service_class])

SELECT * FROM "service_classes" WHERE ("service_classes"."id" = 9)
DELETE FROM "service_classes" WHERE "id" = 9
---
  def destroy
    @service_class = ServiceClass.find(params[:id])
    @service_class.destroy